Documents/ВыдачаПропускаНаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ВыдачаПропускаНаТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияПропусков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаВъездТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПропуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПропусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыПропусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПосещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПосещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаявкаНаВъездТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВъездТС</Name>
			<BasedOn>
				<xr:Item>Task.ЗадачаИсполнителя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияПропусков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВъезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПосещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныПосещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПропуска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПропусков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимноеПомещение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДвиженияТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияПроцесса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольИсполнителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВыдачаПропускаНаТС/Ext/ManagerModule.bsl
Процедура ПечатьПропуска(ТабДок, Ссылка) Экспорт
    Макет = Документы.ВыдачаПропускаНаТС.ПолучитьМакет("ПечатнаяФормаПропуска");
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ВыдачаПропускаНаТС.Заявка.РежимноеПомещение КАК РежимноеПомещение,
    |	ВыдачаПропускаНаТС.Заявка.Номер КАК Номер,
    |	ВыдачаПропускаНаТС.Дата КАК Дата,
    |	ВыдачаПропускаНаТС.ДатаВыдачи КАК ДатаВыдачи,
    |	ВыдачаПропускаНаТС.ДатаОкончания КАК ДатаОкончания,
    |	ВыдачаПропускаНаТС.Инициатор КАК Инициатор,
    |	ВыдачаПропускаНаТС.ФизическоеЛицо КАК ФизическоеЛицо,
    |	ВыдачаПропускаНаТС.ПричинаПосещения КАК ПричинаПосещения,
    |	ВыдачаПропускаНаТС.ТипПропуска КАК ТипПропуска,
    |	ВыдачаПропускаНаТС.ЗонаДоступа КАК ЗонаДоступа,
    |	ВыдачаПропускаНаТС.ТочкаКонтроля КАК ТочкаКонтроля,
    |	ЗаявкаНаВъездТС.ТранспортноеСредство КАК ТранспортноеСредство,
    |	ЗаявкаНаВъездТС.ТранспортноеСредство.НомерТС КАК НомерТС,
    |	ЗаявкаНаВъездТС.ТранспортноеСредство.Марка КАК Марка,
    |	ЗаявкаНаВъездТС.ТранспортноеСредство.Модель КАК Модель
    |ИЗ
    |	Документ.ВыдачаПропускаНаТС КАК ВыдачаПропускаНаТС
    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВъездТС КАК ЗаявкаНаВъездТС
    |		ПО ВыдачаПропускаНаТС.Заявка = ЗаявкаНаВъездТС.Ссылка
    |ГДЕ
    |	ВыдачаПропускаНаТС.Ссылка В(&Ссылка)";
    Запрос.Параметры.Вставить("Ссылка", Ссылка);
    Выборка = Запрос.Выполнить().Выбрать();

    Заголовок = Макет.ПолучитьОбласть("Заголовок");
    Шапка = Макет.ПолучитьОбласть("Шапка");
    ТабДок.Очистить();

    ВставлятьРазделительСтраниц = Ложь;
    Пока Выборка.Следующий() Цикл
        Если ВставлятьРазделительСтраниц Тогда
            ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли; 
		
		// форматирование дат
		Заголовок.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=DD");
        Шапка.Параметры.ДатаВыдачи = Формат(Выборка.ДатаВыдачи, "ДЛФ=DD");
        Шапка.Параметры.ДатаОкончания = Формат(Выборка.ДатаОкончания, "ДЛФ=DD");

        // Заполнение параметров
		Заголовок.Параметры.РежимноеПомещение = Выборка.РежимноеПомещение;
		Заголовок.Параметры.Номер = Выборка.Номер;
        Заголовок.Параметры.ТипПропуска = Выборка.ТипПропуска;

        Шапка.Параметры.ЗонаДоступа = Выборка.ЗонаДоступа;
        Шапка.Параметры.Инициатор = Выборка.Инициатор;
        Шапка.Параметры.ФизическоеЛицо = Выборка.ФизическоеЛицо;
        Шапка.Параметры.ПричинаПосещения = Выборка.ПричинаПосещения;
        Шапка.Параметры.ТочкаКонтроля = Выборка.ТочкаКонтроля; 
		Шапка.Параметры.Марка = Выборка.Марка;
		Шапка.Параметры.Модель = Выборка.Модель;
		Шапка.Параметры.НомерТС = Выборка.НомерТС;
		
		ТабДок.Вывести(Заголовок, Выборка.Уровень());
        ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ВставлятьРазделительСтраниц = Истина;
    КонецЦикла;
		
    // Настройка отображения
    ТабДок.АвтоМасштаб = Истина;
    ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    ТабДок.ТолькоПросмотр = Истина;
КонецПроцедуры
